{
  "getting_there_1": "Aomori was my first stop in the main Japanese island of Honshū where I would remain for the rest of the journey. Travelling between Hokkaido and Honshū can be done via ferry or underwater tunnel. The Seikan Tunnel is the world’s longest tunnel with an underwater segment, and the method I took to reach the main island. Instead of departing from the main JR Hakodate station that I arrived at, I went to the closer but smaller Goryōkaku Station to transfer to Shin-Hakodate Hokuto Station, where I took the Shinkansen to Aomori. Goryōkaku Station is small and ostensibly less travelled by foreigners as the station staff spoke no English, despite accepting my JR pass. I missed my earlier train but luckily (and surprisingly), there was a Starbucks near the station (be sure to check out the coffee shop tier list in the miscellaneous dropdown). I did some work using the wonderful free Starbucks wifi and waited for my train to arrive.",
  "getting_there_2": "My train for the Hokkaido Shinkansen had a memorable bright teal colour, with a pink stripe fully across. Settled into my seat, I continued to try to do work on the train with my pocket wifi but the train kept going underground or underwater, breaking my connection. There are many bullet train systems around the world but the Japanese Shinkansen is particular. There has not been a single passenger injury or fatality while being in operation for over half a century. The ride is smooth, swift and incredibly convenient for locals and foreigners alike. Travelling from Shin Hakodate Hokuto to Shin Aomori (200 kilometers or so) took little more than an hour only.",
  "explore_1": "There weren’t many good options for hostels in Aomori near the water where I wanted to stay, but I was able to find a cheap hotel on the main downtown strip in Aomori. I arrived at Art hotel Color Aomori hours before check in, but luckily they let me check in early. The downtown street was very quiet, with only a few locals here or there. The hotel was equally empty, not seeing any other people besides the front desk staff and the room cleaners. The room was very carefully cleaned and the bed was queen size, a welcome sight. Walking around downtown Aomori midday to explore, I found that the area didn’t have much to do. Stores were small and mostly closed, and not many restaurants were open. I did spot this house drying some daikon radishes outside their window which was neat.",
  "explore_2": "One nice thing about my hotel was that it was very close to Mutsu Bay. I walked to the pier and sat down on a bench to watch the water for a while. The pier was very large, with huge walkways but few people since it was getting late. When going out to explore, I often brought my camera and notebook with a pen. I was uncomfortable taking pictures in very local spots because I felt like I was intruding or causing a disturbance for the locals that lived there. Aomori was very local but felt deserted at times, offering ample opportunity to snap pictures and journal or draw outside.",
  "explore_3": "On the pier stands an interesting architectural building: this immense triangular tower. This looming tower is the Aomori Tourist Information Center or ASPAM. The shape comes from the letter “A” in Aomori. The 15 floor building has stores on the lower floors that sell seemingly every apple product such as apple juice, cider, apple pies, and apple flavoured ice cream. This is because Aomori is known for their apples, in which the city produces the most apples in all of Japan. They have apple farms so apple picking can be done here, and they even have apple hot springs where one can enjoy the heat of a nice natural bath while bobbing for apples! On upper floors, there are some local shops and entertainment exhibits, explaining the history and culture of Aomori. Finally, there is an observation desk with a nice view of the water.",
  "museum_1": "The main thing I wanted to see in Aomori is their famous Nebuta Festival. It occurs around the end of summer every year and is one of the largest festivals in Japan. The festival involves parading large, lit floats of warriors throughout the city with dancing and music. The floats are nothing like I’ve seen before. They are enormous, strikingly colourful, and so detailed despite their size. The floats are always hand made with wooden base structures, light systems within, and thin coloured paper decorating the outside. While I missed the actual night festival since I was in Aomori late in the year, the Nebuta Museum Wa Rasse proudly exhibits previously paraded floats and demonstrates the process in which they are created.",
  "museum_2": "The term nebuta refers to drowsiness, in which the festival is a means of waking up the sleeping souls with the upcoming fall harvest. Some time before the actual festival, floats are planned and meticulously created. The process explained by the museum involves using wood or bamboo as the basic structure of parts of the float, and then metal wires are used to fashion whatever shape is desired. Light bulbs or lanterns are placed inside these contraptions, which shine brightly through the delicate papier-mâché exterior that provides the vibrancy of colour to the float. The floats vary in size, with larger ones being over 15 meters wide and 8 meters tall.",
  "museum_3": "The floats tell folk stories or historic events involving samurai warriors and Japanese generals. Most floats on display at the museum had a small plaque describing the float in both Japanese and English. One float was built to demonstrate the mythology of the origin of Japan. Another float revealed a poem written by a warrior that killed an emperor who revolted against the Imperial Court by manipulating demons. This unique method of retelling Japanese mythology and legends was the highlight of Aomori for me. It is amazing that the tradition has survived for over 300 years, with brand new floats created annually, and stories continuously passed down generation by generation. I hope to one day in early August, return to Aomori to witness and participate in the festival.",
  "headers": {
    "explore": "Exploring Aomori",
    "museum": "Nebuta Museum Wa Rasse"
  }
}