{
  "sapporo": {
    "city": "Sapporo",
    "foods": [
      {
        "name": "Galbi Don",
        "name_jp": "カルビドン",
        "rating": 2,
        "restaurant": "Maruha's Galbi Don",
        "address": "3 Chome-1-12 Kita 18 Jonishi, Kita Ward, Sapporo, Hokkaido 001-0018, Japan",
        "website": "http://www.maruha-karubi.com/",
        "review": "This was my first meal in Japan. It was cheap, quick and Korean. At the time, I was very hungry so I would have rated it a 3 star meal but looking back, it was pretty disappointing for my first meal. The amount of beef was pretty small and the quality was not great either (compared to beef later on in the trip). However, they gave free kimchi, adding a nice kick to the meal.",
        "images": [
          "galbi1"
        ]
      },
      {
        "name": "Miso Ramen",
        "name_jp": "味噌ラーメン",
        "rating": 3,
        "restaurant": "らぁめん支那虎 札幌店",
        "address": "5 Chome-2-5 Kita 18 Jonishi, Kita Ward, Sapporo, Hokkaido 001-0018, Japan",
        "review": "I was very excited to have my first meal of ramen in Japan. This place was close to my hostel and I remember having to brush aside this hanging cloth to enter. I ordered their signature miso ramen and it was delicious. They throw in a lot of scallions and the pork belly was so soft. The broth was piping hot and full of umami, warming me up and giving me energy for my day of travelling ahead.",
        "images": [
          "misoramen1",
          "misoramen2",
          "misoramen3"
        ]
      },
      {
        "name": "Soup Curry",
        "name_jp": "スープカレー",
        "rating": 4,
        "restaurant": "スープカレー奥芝商店 駅前創成寺",
        "address": "Japan, 〒060-0004 Hokkaido, Sapporo, Chuo Ward, Kita 4 Jonishi, 1 Chome, ホクレンビル B1F",
        "review": "After a rainy morning in Sapporo, I hid under a building looking for a lunch spot near me. I searched and found that Sapporo is famous for its soup curry, where it actually originated from. I found this store and got there around 1:30pm and there still was a huge line outside of the shop. I waited around half an hour before I was seated inside right in front of where the chefs make the food. The interior is warm and filled with dark wood, giving a nice homey feeling. You can see the chefs cook the curry and prepare everything from scratch. The soup curry was hearty, full of meat and vegetables, and generally very delicious. It had a large meatball, potatoes, carrots, eggplant, spinach, eggs and was served with a bowl of rice. I would highly recommend it if you visit Sapporo!",
        "recommend": true,
        "images": [
          "soupcurry1",
          "soupcurry2",
          "soupcurry3",
          "soupcurry4"
        ]
      },
      {
        "name": "Konbini Onigiri",
        "name_jp": "おにぎり",
        "rating": 5,
        "restaurant": "7/11",
        "review": "Konbinis (or convenience stores) are found everywhere throughout Japan. My go-to food throughout my trip (and also in my various trips to Japan before this one) has been rice balls, always found lined up neatly on refrigerated shelves in konbinis. They have various fillings including tuna mayonnaise, fish roe, seasoned pork, pickled plum, and salmon. First timers may have difficulty opening the onigiri properly, so I would highly recommend googling how to do it properly (it's mostly a matter of following the numbers on the packaging). Quick, cheap, delicious and filling - nothing else needs to be said.",
        "recommend": true,
        "images": [
          "onigiri1",
          "onigiri2",
          "onigiri3"
        ]
      }
    ]
  },
  "hakodate": {
    "city": "Hakodate",
    "foods": [
      {
        "name": "Maguro Uni Don",
        "name_jp": "まぐろうに丼",
        "rating": 3,
        "restaurant": "Sushi Hakodate",
        "address": "Japan, 〒040-0063 Hokkaido, Hakodate, Wakamatsucho, 9−14 はこだて朝市どんぶり横丁市場内",
        "website": "https://www.sushidokoro-hakodate.com/",
        "review": "Right after my four and a half hour train ride to Hakodate station, I was feeling famished and looked for food near the station. The station was near the water so there was a marketplace with a lot of seafood options. While being overpriced, the Maguro (tuna) and Uni (sea urchin) Don that I ordered at Sushi Hakodate was delightful. Being my first taste of fresh raw fish in Japan this trip, I was very excited and the packed bowl did not disappoint. The uni was decent, but the lean maguro mixed with shoyu and sushi rice really made me feel grateful to have been there at the time.",
        "images": [
          "don1",
          "don2",
          "don3"
        ]
      },
      {
        "name": "Shio Ramen",
        "name_jp": "しおラーメン",
        "rating": 2,
        "restaurant": "KITACHI AJISAI SHOKUDO",
        "address": "29-22 Goryokakucho, Hakodate, Hokkaido 040-0001, Japan",
        "website": "http://www.ajisai.tv/",
        "review": "I ordered a bowl of Shio Ramen, the recommended bowl of ramen at Ajisai ramen near Fort Goryokaku. The broth was more clear than flavourful, making me crave my first bowl of ramen in Sapporo. It was a quick bowl of ramen, but I strongly prefer ramen having a strong and flavourful broth that sticks tight to a pull of al dente noodles, the oil and fat remaining on my lips after I slurp 'em up.",
        "images": [
          "shio1"
        ]
      },
      {
        "name": "Hot Tempura Soba",
        "name_jp": "天ぷらそば",
        "rating": 5,
        "restaurant": "YATARAYA",
        "address": "1 Chome-28-1 Yunokawacho, Hakodate, Hokkaido 042-0932, Japan",
        "recommend": true,
        "review": "Near my hostel Tune Hakodate, this mom and pop shop is a must visit if you're a fan of soba noodles. I remember my first time having fancy soba in Kyoto with Minsu in 2017, and at that time I didn't care for it at all. Over time, I grew to appreciate the simplicity, craft and health benefits of soba noodles. I normally enjoy a nice cold soba with the classic dipping sauce with green onions. At Yataraya, I ordered a hot soba soup with tempura. The soup was extremely flavourful, made of a simple yet elegant shoyu and homemade dashi broth. The tempura was cleanly fried, providing great contrast to the texture of the firm soba noodles. As you can see from the last image, I didn't leave a single drop remaining.",
        "images": [
          "soba1",
          "soba2",
          "soba3"
        ]
      },
      {
        "name": "Conveyor Belt Sushi",
        "name_jp": "回転寿司",
        "rating": 4,
        "restaurant": "Kantaro Sushi",
        "address": "14-4 Ugauracho, Hakodate, Hokkaido 040-0023, Japan",
        "website": "https://www.hk-r.jp/",
        "review": "My first of many trips to conveyor belt sushi restaurants was to Kantaro Sushi in Hakodate. I remember walking 40 minutes at night from my hostel to this restaurant near the water due to its high reviews. Conveyor belt sushi is amazing: little to no communication required with staff, no judgment as you stack up your coloured plates, and it's also just plain fun. You could even grab your own beer here and bring it to your seat. The fish quality is pretty good, and I consumed a lot of food (and drink) coming to a total of around $35.",
        "images": [
          "sushi1",
          "sushi2",
          "sushi3",
          "sushi4"
        ]
      }
    ]
  },
  "aomori": {
    "city": "Aomori",
    "foods": [
      {
        "name": "Yakisoba",
        "name_jp": "焼きそば",
        "rating": 2,
        "restaurant": "Lawson (ローソン)",
        "address": "2 Chome-8-1 Yasukata, Aomori, 030-0803, Japan",
        "review": "Arriving around midday in Aomori, not many restaurants were open. Walking around, I stumbled upon a nearby Lawson and decided to grab a late lunch there. I purchased this yakisoba that looked not half bad. It had some veggies in it, coloured nicely in some type of sweet shoyu sauce, and topped with thin slices of bacon and pickled ginger. I bought some snacks and drinks to accompany the meal. The yakisoba was decent for microwaved convenience food and but for sure better than any convenience food in America. I of course wanted to try to eat local specialties and everything Japanese cuisine but in a two month trip, sometimes a quick and fast meal at a konbini was what I craved.",
        "images": [
          "yakisoba1",
          "yakisoba2"
        ]
      },
      {
        "name": "Steak",
        "name_jp": "ステーキ",
        "rating": 3,
        "restaurant": "Ikinari Steak Aomori Station",
        "address": "1 Chome-9-18 Shinmachi, Aomori, 030-0801, Japan",
        "review": "Ikinari Steak is a type of higher quality fast food restaurant found in Japan but also in other cities around the world such as New York City. They specialize in steaks done your way and is made usually very quickly, providing a convenient and meaty meal. The meal comes with some corn, soup and salad, providing nice clean and textural breaks between each bite of meat. I've had it on a previous trip to Japan but wanted to get it at least once this trip and the shop was close to where I stayed, so I tried it out. The steak itself was nice and tender, cooked medium rare as asked. The price is a bit more expensive compared to other fast food or local restaurants, but worth it for a large nourishing meal.",
        "images": [
          "steak1"
        ]
      },
      {
        "name": "Apple Pie",
        "name_jp": "アップルパイ",
        "rating": 3,
        "restaurant": "A-Factory",
        "address": "1 Chome-4-2 Yanakawa, Aomori, 038-0012, Japan",
        "review": "Famous for their apples, Aomori's A-Factory is a building with a bunch of smaller stores inside selling apple products. After looking through, I decided on trying a small apple pie. The pie was tart and delicious, and I was happy to enjoy it outside near on the pier, near Mustsu Bay.",
        "images": [
          "pie"
        ]
      },
      {
        "name": "Celery Sticks",
        "name_jp": "カットセロリ",
        "rating": 1,
        "restaurant": "Lawson (ローソン)",
        "address": "2 Chome-8-1 Yasukata, Aomori, 030-0803, Japan",
        "review": "It's sometimes hard to find vegetables in meals when eating out all the time in Japan so I craved some greens. However, I felt like a rabbit eating these celery sticks raw, would not recommend.",
        "images": [
          "celery"
        ]
      }
    ]
  },
  "morioka": {
    "city": "Morioka",
    "foods": [
      
    ]
  },
  "ishinomaki": {
    "city": "Ishinomaki",
    "foods": [
      
    ]
  },
  "sendai": {
    "city": "Sendai",
    "foods": [
      
    ]
  },
  "tokyo": {
    "city": "Tokyo",
    "foods": [
      
    ]
  },
  "yokohama": {
    "city": "Yokohama",
    "foods": [
      
    ]
  },
  "shizuoka": {
    "city": "Shizuoka",
    "foods": [
      
    ]
  },
  "nagoya": {
    "city": "Nagoya",
    "foods": [
      
    ]
  },
  "kyoto": {
    "city": "Kyoto",
    "foods": [
      
    ]
  },
  "kobe": {
    "city": "Kobe",
    "foods": [
      
    ]
  },
  "hiroshima": {
    "city": "Hiroshima",
    "foods": [
      
    ]
  },
  "busan": {
    "city": "Busan",
    "foods": [
      
    ]
  },
  "nara": {
    "city": "Nara",
    "foods": [
      
    ]
  },
  "osaka": {
    "city": "Osaka",
    "foods": [
      
    ]
  },
  "tokyo_two": {
    "city": "Tokyo (Round 2)",
    "foods": [
      
    ]
  }
}
