{
  "sapporo": {
    "city": "Sapporo",
    "foods": [
      {
        "name": "Galbi Don",
        "name_jp": "カルビドン",
        "rating": 2,
        "restaurant": "Maruha's Galbi Don",
        "address": "3 Chome-1-12 Kita 18 Jonishi, Kita Ward, Sapporo, Hokkaido 001-0018, Japan",
        "website": "http://www.maruha-karubi.com/",
        "review": "This was my first meal in Japan. It was cheap, quick and Korean. At the time, I was very hungry so I would have rated it a 3 star meal but looking back, it was pretty disappointing for my first meal. The amount of beef was pretty small and the quality was not great either (compared to beef later on in the trip). However, they gave free kimchi, adding a nice kick to the meal.",
        "images": [
          "galbi1"
        ]
      },
      {
        "name": "Miso Ramen",
        "name_jp": "味噌ラーメン",
        "rating": 3,
        "restaurant": "らぁめん支那虎 札幌店",
        "address": "5 Chome-2-5 Kita 18 Jonishi, Kita Ward, Sapporo, Hokkaido 001-0018, Japan",
        "review": "I was very excited to have my first meal of ramen in Japan. This place was close to my hostel and I remember having to brush aside this hanging cloth to enter. I ordered their signature miso ramen and it was delicious. They throw in a lot of scallions and the pork belly was so soft. The broth is full of umami and piping hot, warming me up and giving me energy for my day of travelling ahead.",
        "images": [
          "misoramen1",
          "misoramen2",
          "misoramen3"
        ]
      },
      {
        "name": "Soup Curry",
        "name_jp": "スープカレー",
        "rating": 4,
        "restaurant": "スープカレー奥芝商店 駅前創成寺",
        "address": "Japan, 〒060-0004 Hokkaido, Sapporo, Chuo Ward, Kita 4 Jonishi, 1 Chome, ホクレンビル B1F",
        "review": "After a rainy morning in Sapporo, I hid under a building looking for a lunch spot near me. I searched and found that Sapporo is famous for its soup curry, where it actually originated from. I found this store and got there around 1:30pm and there still was a huge line outside of the shop. I waited around half an hour before I was seated inside right in front of where the chefs make the food. The interior is warm and filled with dark wood, giving a nice homey feeling. You can see the chefs cook the curry and prepare everything from scratch. The soup curry was hearty, full of meat and vegetables, and generally very delicious. It had a large meatball, potatoes, carrots, eggplant, spinach, eggs and was served with a bowl of rice. I would highly recommend it if you visit Sapporo!",
        "recommend": true,
        "images": [
          "soupcurry1",
          "soupcurry2",
          "soupcurry3",
          "soupcurry4"
        ]
      },
      {
        "name": "Konbini Onigiri",
        "name_jp": "おにぎり",
        "rating": 5,
        "restaurant": "7/11",
        "review": "Konbinis (or convenience stores) are found everywhere throughout Japan. My go-to food throughout my trip (and also in my various trips to Japan before this one) has been rice balls, always found lined up neatly on refrigerated shelves in konbinis. They have various fillings including tuna mayonnaise, fish roe, seasoned pork, pickled plum, and salmon. First timers may have difficulty opening the onigiri properly, so I would highly recommend googling how to do it properly (it's mostly a matter of following the numbers on the packaging). Quick, cheap, delicious and filling - nothing else needs to be said.",
        "recommend": true,
        "images": [
          "onigiri1",
          "onigiri2"
        ]
      }
    ]
  },
  "hakodate": {
    "city": "Hakodate",
    "foods": [
      
    ]
  },
  "aomori": {
    "city": "Aomori",
    "foods": [
      
    ]
  },
  "morioka": {
    "city": "Morioka",
    "foods": [
      
    ]
  },
  "ishinomaki": {
    "city": "Ishinomaki",
    "foods": [
      
    ]
  },
  "sendai": {
    "city": "Sendai",
    "foods": [
      
    ]
  },
  "tokyo": {
    "city": "Tokyo",
    "foods": [
      
    ]
  },
  "yokohama": {
    "city": "Yokohama",
    "foods": [
      
    ]
  },
  "shizuoka": {
    "city": "Shizuoka",
    "foods": [
      
    ]
  },
  "nagoya": {
    "city": "Nagoya",
    "foods": [
      
    ]
  },
  "kyoto": {
    "city": "Kyoto",
    "foods": [
      
    ]
  },
  "kobe": {
    "city": "Kobe",
    "foods": [
      
    ]
  },
  "hiroshima": {
    "city": "Hiroshima",
    "foods": [
      
    ]
  },
  "busan": {
    "city": "Busan",
    "foods": [
      
    ]
  },
  "nara": {
    "city": "Nara",
    "foods": [
      
    ]
  },
  "osaka": {
    "city": "Osaka",
    "foods": [
      
    ]
  },
  "tokyo_two": {
    "city": "Tokyo (Round 2)",
    "foods": [
      
    ]
  }
}
