{
  "getting_there": "The morning of October 20th, I woke up early and quietly packed my things so as to not wake up the other hostel stayers in my room. It was too hot to carry everything and wear my new winter jacket so I wrapped it up tight and clipped it to the side of my bag. It was pretty heavy carrying everything but it became easier and easier the more I travelled. I was excited to trade breaking my back with gaining a sweet pair of chiseled calves by the end of the trip. I travelled to Hakodate from Sapporo via JR Rail, which took around four and a half hours. I grabbed a quick bite and coffee from Lotteria before heading to my platform.",
  "jr_1": "Japan Railways (JR) owns the main rail system used by locals and foreigners to get across Japan. The JR Pass I ordered provides transport all over Japan, with access to most railways, local trains, shinkansens and specific JR busses. The pass can be used to also reserve seats on trains, which I highly recommend for travel to busier cities like Osaka and Tokyo. Many times on this trip however, I forgot or was too lazy to reserve a seat and ended up standing between two train cars. JR trains are very fast, pleasant to ride, and a great way to get between cities (with the exception of travelling to Sapporo from Tokyo, in which I would recommend maybe taking a short flight). One can see a diverse set of views including high buildings in larger cities, farmland and waterways, distant mountainous ranges, and dark underground tunnels.",
  "jr_2": "Train stations may be initially daunting, packed with people rushing around finding their platforms and catching their trains. Some stations have dozens of platform signs pointing in all angles. The staff at train stations generally speak decent English so should be of help if needed. Look for the JR logo to know whether you’re in the right area when using the JR pass. Some local trains do not accept JR and very often I would need to take some of these local trains. I purchased a very useful Suica card which acted as my transit card for these local trains. Once you reach the platform, you may see coloured shapes on the ground next to where you might board. These coloured shapes map to the train coming to that platform. This information should be available on the display near the platform. For instance, the display might show 3 different trains that stop here. The first might have a red circle, the second a blue square, and the third a yellow triangle. If you are taking the first train, line up behind the red circle and patiently wait for your train to arrive.",
  "jr_3": "Most train stations I came upon had food vendors or small konbinis on the platform and in the station as well. They are great for grabbing a drink and snack for your ride. For shorter rides, I would recommend against eating but when you are riding the Shinkansen, which normally has a longer duration, it is generally acceptable to eat. If you need to take a call on a Shinkansen, I would recommend going to the space between cars and taking it there. Be sure to also keep your ticket on you and to seat yourself at the right train car and spot. Finally, if you do purchase the JR Pass, remember that the JR Pass does not qualify for the Nozomi shinkansen line. I actually made the mistake myself of riding the Nozomi line without a ticket and I was told to get off at the next stop which I did.",
  "fort": "One of the main attractions in Hakodate is Fort Goryōkaku: built in 1855, it was once a unique western styled fortress but now is maintained as a historical site. The fort is unique because of its star shaped layout where “Go” means 5 and “Ryōkaku” means ridges. The fort is surrounded by a star shaped moat as well that looks incredible from up above. I chose not to pay to go up the observation tower for the view and instead chose to slowly walk through the large park. Fall colours were coming in at the time and the trees inside the park were beautiful. If I had gone in the spring, I would have had the opportunity to view the cherry blossom trees as this location is one of Hokkaido’s best cherry blossom spots. The park was also littered with informational signs in both English and Japanese, explaining the various bridges and buildings that reside inside the park.",
  "headers": {
    "jr": "Japan Railways",
    "fort": "Hakodate Goryōkaku"
  }
}