{
  "intro": "Almost halfway in between the northern tip of Honshū and Tokyo lies a coastal city called Ishinomaki. Ishinomaki is the smallest city I visited on my trip, with a population less than both Aomori and Morioka. The main reason for why I wanted to visit Ishinomaki was to see Tashirojima, the famous island of cats. However, I fell in love with the city for other reasons (also, I missed the morning ferry that takes you to the island so I didn’t even get to see Tashirojima). Sadly, Ishinomaki is known for being the city that took the biggest blow from the 2011 Tsunami in terms of death toll and city damage. Many of the lower lying neighbourhoods and waterfront districts were completely submerged by the tsunami.  While exploring Ishinomaki, I noticed some unique things such as signs indicating dangerous water levels and nearby shelters. It made me aware of how I was walking in a place that was once devastated by a giant natural disaster. Along with the experience of visiting the earthquake museum in Kobe later in my trip, Ishinomaki helped me realize the scale of damage natural disasters can cause and the lasting impact they have on a city and their people.",
  "manga_1": "Many of my friends would (falsely) claim that I am a Weeabo. A Weeabo is a person who is obsessed with Japanese culture. While I did take 9 months of Japanese language classes, spent months learning and cooking Japanese cuisine, and own not one, but two Japanese swords; I don’t believe I am a Weeabo and do not appreciate the weekly baseless accusations of such. My main counter argument through the years has been that I don’t watch anime, where anime is a large part of Japanese or Weeabo culture in western eyes. Instead, I read manga which is obviously completely different. Manga is the Japanese equivalent comic or graphic novel, a medium I occasionally enjoy dabbling in. I mention manga because Ishinomaki is where the famous mangaka (manga artist) Shotaro Ishinomori (石ノ森 章太郎) resided. Ishinomori is a legendary mangaka known for the Kamen Rider and Cyborg 009 series. The city of Ishinomaki pays tribute to Ishinomori in two ways.",
  "manga_2": "When you reach Ishinomaki station from Sendai, what you might notice immediately are the life sized manga characters statues. The station and the surrounding streets are decorated with statues of Kamen Rider and Cyborg 009 characters. I arrived in Ishinomaki station early and realized that the trains from Ishinomaki station to the station near my hostel came very infrequently, maybe once every few hours. I had missed my train, so I went outside the station and noticed the statues. They were littered throughout the main streets, still pristine and colourful in paint. I distinctly recall my bags being very heavy at this point, as I trudged around, snapping pictures.",
  "headers": {
    "manga": "Ishinomori Shotaro"
  }
}