{
  "intro": "Almost halfway in between the northern tip of Honshū and Tokyo lies a coastal city called Ishinomaki. Ishinomaki is the smallest city I visited on my trip, with a population less than both Aomori and Morioka. The main reason for why I wanted to visit Ishinomaki was to see Tashirojima, the famous island of cats. However, I fell in love with the city for other reasons (also, I missed the morning ferry that takes you to the island so I didn’t even get to see Tashirojima). Sadly, Ishinomaki is known for being the city that took the biggest blow from the 2011 Tsunami in terms of death toll and city damage. Many of the lower lying neighbourhoods and waterfront districts were completely submerged by the tsunami.  While exploring Ishinomaki, I noticed some unique things such as signs indicating dangerous water levels and nearby shelters. It made me aware of how I was walking in a place that was once devastated by a giant natural disaster. Along with the experience of visiting the earthquake museum in Kobe later in my trip, Ishinomaki helped me realize the scale of damage natural disasters can cause and the lasting impact they have on a city and their people.",
  "manga_1": "Many of my friends would (falsely) claim that I am a Weeabo. A Weeabo is a person who is obsessed with Japanese culture. While I did take 9 months of Japanese language classes, spent months learning and cooking Japanese cuisine, and own not one, but two Japanese swords; I don’t believe I am a Weeabo and do not appreciate the weekly baseless accusations of such. My main counter argument through the years has been that I don’t watch anime, where anime is a large part of Japanese or Weeabo culture in western eyes. Instead, I read manga which is obviously completely different. Manga is the Japanese equivalent comic or graphic novel, a medium I occasionally enjoy dabbling in. I mention manga because Ishinomaki is where the famous mangaka (manga artist) Shotaro Ishinomori (石ノ森 章太郎) resided. Ishinomori is a legendary mangaka known for the Kamen Rider and Cyborg 009 series. The city of Ishinomaki pays tribute to Ishinomori in two ways.",
  "manga_2": "When you reach Ishinomaki station from Sendai, what you might notice immediately are the life sized manga characters statues. The station and the surrounding streets are decorated with statues of Kamen Rider and Cyborg 009 characters. I arrived in Ishinomaki station early and realized that the trains from Ishinomaki station to the station near my hostel came very infrequently, maybe once every few hours. I had missed my train, so I went outside the station and noticed the statues. They were littered throughout the main streets, still pristine and colourful in paint. I distinctly recall my bags being very heavy at this point, as I trudged around, snapping pictures.",
  "park_1": "So, about Tashirojima, the island of cats… I did minimal research beforehand, discovering that the only way to get to the island was by ferry. The ferry times appeared on their official website, which is entirely in Japanese. I translated the website to English but the times table didn’t translate and was very confusing. I decided to just wake up early and try to catch what looked to be an noon-ish ferry. I walked a half hour from my hostel to get to the ferry, only to find not a single soul there: no people, no boats, no visible English signage. I looked around for 10 minutes or so until I noticed a man who had come out of a shack and began feeding some cats. I approached him with some English, asking about where the ferry was but he didn’t speak any English. This language was too specific so my Japanese was near useless as well. Stuck with being unable to communicate with the man, I pulled out my trusty phone with Google translate and began typing English, using the text to speech feature to communicate. After some back and forth passing of my phone, I managed to somewhat understand that I sadly missed the ferry and the next one would be in hours. My head hung, I left the way I came, my camera vacant of cat photos, and my life hollow from the absence of feline company.",
  "park_2": "On the way there (and on the way back), I walked along the water. Specifically, I walked along the Kyukitakami River. While walking on the road next to the river, you will spot a tall, forested hill. This hill is Hiyoriyama Park which I visited on the way back from the ferry. I recall climbing hilly and winding local streets to reach the small mountain. Streets that reminded me of San Francisco. The park provides an amazing lookout of the city, and is famous for being a great place to see cherry blossoms in the springtime. There are also statues of famous people within the park, including that of Matsuo Bashō: one of, if not the greatest haiku poet of all time. What is more relevant and more important about the mountain is that it served as a place of refuge in the 2011 Tsunami. They have photos displaying the views of Ishinomaki before the tsunami and comparing them to the current views, I witnessed the aftermath and impact of the natural disaster.",
  "park_3": "At the top of the mountain, there is a large shrine called Kashimamiko shrine. Generations of fishermen have climbed the mountain, praying at the shrine for luck and safe passage before heading to sea.",
  "dam_1": "Smaller cities like Morioka and Ishinomaki have less visitors so it’s generally harder to find hostels to stay at. For Ishinomaki, it was even difficult to find a hotel. However, I did manage to find a hostel called Active Life -YADO-. As I mentioned earlier, I had to take a local train from Ishinomaki station to a small station called Watanoha station to get to my hostel. Located in a very residential area, the hostel was surrounded by homes with backyards, and tiny local stores selling produce and general goods. It was also near the water, intended for travellers who wanted to come and surf. I was the only person who stayed there at the time. There were not many restaurants nearby, but luckily, there was a 7/11 right beside the hostel, so I ate most of my meals there. A common area was available, but I worked in my room, crouched in the bottom bunk of a bunk bed.",
  "dam_2": "After a day of working, I locked up my stuff, grabbed my wallet, camera and phone, and then headed out for a walk. I wanted to go see the water close to the hostel. I stopped by 7/11, picked up an onigiri and some orange juice, and headed east along the main road. At some point, I had to turn into this street to head south towards the water, passing by a couple of industrial looking buildings. At the end of this street, I saw a low level dam blocking the view of the water. However, there was a fence preventing people from reaching the top of the dam. I figured I was already this far and saw that there were steps to get to the top so might as well climb over the fence and see the water. I recall the steps being so steep I had to lean my body forward to climb up safely, but it was worth it. The view at the top was beautiful. I sat down, taking in the view of the ocean in front of me. There was not a single soul around. The only sounds were of the callous wind and the waves hitting below me.",
  "dam_3": "Sitting atop this dam, it dawned on me exactly where I was and what I was doing. I had just finished my first week solo travelling ever. I had visited 5 cities already, managing my way around trains, busses, and local streets in a country where I barely spoke the language. I worked weird hours in coffee shops, trains, in bed, and in hostel common areas (later on, I’ve also worked on park benches, atop of mountains in the middle of hikes, and even in front of a giant Buddha). Most importantly, I realized how fortunate I was to have been given this opportunity: to be able to travel to a foreign country halfway across the world, to be able to afford it, and to be able to work remotely and maintain my job through it. I was and am thankful for my family and friends, my manager, team, and company, and of course for Japan. The gratitude for what I had experienced made me even more excited for what laid ahead for me on my adventure. These feelings are why Ishinomaki is my favourite city that I visited on my trip across Japan.",
  "yeye_1": "My favourite place that I visited in Japan was a city called Ishinomaki. Located in the eastern coast of Japan near Sendai, I had no expectations for the place. I remember taking the train from Sendai to Ishinomaki, where people got off each stop until there were maybe 6 people left in my train.",
  "yeye_2": "Ishinomaki is a smaller, quieter city compared to the cities I had been to so far on the trip. Sapporo was busy, with restaurants selling specialty foods at every corner near my hostel. The spots I visited in Hakodate were flooded with both foreign and Japanese tourists. Aomori is famous for its apples and unique display of culture through large colourful floats. Ishinomaki on the other hand, seemed to be less visited.",
  "yeye_3": "The first thing you notice when getting off the train at the main Ishinomaki station is the size of the station. It is a lot smaller compared to the other stations in nearby cities, but the Japanese employees working at the station were eager to help and very kind. I had to transfer to a farther station for my hostel and when I asked for help, they left their desk to come out and point out which platform I had to go to.",
  "yeye_4": "One issue with smaller stations like Ishinomaki station is that certain trains come only every 1-2 hours. I missed my train so I decided to walk around the station. Ishinomaki is famous for having a museum dedicated to Shotaro Ishinomori, the creator of Kamen Rider. This explains why throughout the main part of the city near Ishinomaki station, there are life size statues of manga characters everywhere. I wanted to take a picture of every statue but I was carrying everything I had so I could only snap a half dozen or so.",
  "yeye_5": "Going back to Ishinomaki station, I sat on a bench near the station debating whether to just wait for the next train or to do something while carrying all my things. As I waited, I noticed a couple of dragonflies resting on my circular bench. The dragonflies were so close and wouldn't fly away when I took pictures of them or when a kid came over and poked their wings. I thought about the last time I saw a dragonfly and I couldn't remember, it had been a very long time.",
  "yeye_6": "Seeing the dragonfly immediately made me think about my paternal grandfather. Yeye and I had a weird relationship. I was born in China and spent some time in his home in Shenyang but I don't remember any of that. Afterwards, we moved to Canada where I grew up, away from him. My dad would always try to call my relatives back home so I could get some face time with him.",
  "yeye_7": "I have one younger cousin by one year and one older cousin by one year on that side of the family. Both cousins lived in China with or near my grandpa. Despite this, my dad always told me my grandpa loved me the most. I didn't understand or take this to heart since I was young, but later on in life, my cousins and other relatives echoed the same opinion to me.",
  "yeye_8": "One year when I was in grade 5 or 6, my grandpa came to visit us in Scarborough. I don't remember too much of what happened during that time except for two things. One day, I was sitting on the curb of a roundabout playing Super Mario Bros on my Gameboy with some friends. Other kids in the neighbourhood were out too, playing in that roundabout. I had my legs stretched out, mindlessly playing my game. That's when another kid ran her bike over my legs by accident. I remember bawling, yelling in pain. Then I vividly remember my grandpa running out of the house, who also began crying while trying to console me. Imagine a crying child bleeding down his legs, and an old man next to him, not knowing how to immediately help, bawling as well, if not more so. I still have those scars on my knees and those remind me of him as well.",
  "yeye_9": "The other thing my grandpa would do with me when he visited was that we would head together to the grassy hill area behind our house, and look for insects. He was adept at catching grasshoppers, taught me to listen for them, approach them slowly, and use two hands to quickly clamp around them. I would then catch grasshoppers that summer, imprison them in a plastic water bottle, place them in our garage and hope they live for more than a week.",
  "yeye_10": "Yeye was also able to catch dragonflies. He had large but gentle hands, yet was able to quickly and softly grab hold of dragonflies. The pinch was always soft enough to not damage them, but firm enough to capture the animal. While I was able to catch grasshoppers within a few tries, I was never able to catch a dragonfly.",
  "yeye_11": "Yeye is the kindest man I've ever known. Unlike my dad who personifies the ideal Chinese stone faced, working man, my memories of my grandpa were of his gentle hands, eyes and smile. My dad told me a story of when my dad was a kid. There was a wild dog in the neighbourhood. Other kids would often throw rocks at the dog and chase it trying to hurt it. My grandpa saw this happen once and chased the kids away. He also ended up taking in the dog and raising it with the family.",
  "yeye_12": "When I left Ishinomaki, I was sitting inside the train and I noticed dozens of dragonflies flying outside the window. I thought then about what I learned in Ishinomaki about myself. I realized that to this day, I still don't know why my grandpa loved me the most. I don't know what I did to deserve it. I was a stupid child and didn't think about reciprocating any love to him. I would hate those calls to China because I wanted to play video games or watch TV. I went back to China in early high school because his health was deteriorating and I saw him on his deathbed. My mandarin is piss poor so I wasn't able to articulate anything I wanted to at the time. I'll always regret not being able to say at the time what I want to say to him now.",
  "yeye_13": "I didn't and still don't deserve to have been your favourite grandchild. I know I don't have the chance to show you, but I want to become someone you can be proud of. I want to be as kind, emotional and loving as you. I want to thank you for teaching me how to catch dragonflies, and I hope one day I can show my love for someone the same way you showed me.",
  "headers": {
    "manga": "Ishinomori Shotaro",
    "park": "Hiyoriyama Park",
    "dam": "Damn, that's a nice dam"
  }
}