{
  "intro": "After spending two days in Aomori, I left early in the morning on October 24th to head further south in Japan. My next stop was Morioka, another small and peaceful city with a similar population as Aomori. Morioka is generally more rural but I stayed mostly near Morioka station, the more urban area of Morioka. Like usual, I arrived at my next destination early, ending up working in a coffee shop with my belongings because check in for hotels and hostels were usually past 3pm. I remember Morioka station being decently large, with quite a few restaurants in an underground section, and some buildings and coffee shops right outside. To preface this city, I want to point out that I went out to the main outdoor destinations at night so I was not able to take that many photos with my camera. I also only spent two days in Morioka, and visited most of the attractions on the main full day I had.",
  "park_1": "Half an hour walk away from my hotel was Morioka Castle and its surrounding park, known as Iwate Park or Morioka Castle Ruins Park. The castle was developed in the early 1600’s for the Nanbu samurai clan, the rulers of most of the northeast area of Honshū at the time. The castle itself was torn down later as part of the Meiji Restoration, but then later refurbished into the park that lives there today. Statues and other plaques litter the park grounds, providing more information about the castle that once stood there.",
  "park_2": "The rare Edo period castle was nice to visit during the fall season. Walking from the hotel to the park, I recall the blue sky getting darker, slowly being consumed by the glow of the setting sun. I walked by a Japanese daycare (as opposed to an American one I guess), and kids were laughing and running outside in a fenced yard behind the school. The daycare neighboured the Nakatsu River, in which the castle was also built next to. The park was densely filled with colourful trees and the ground was scattered with fallen leaves. Within the castle walls, a small bridge with red handrails connected two upper castle grounds. What seemed to be a giant tomb stood tall in one area of the park, with an informational card that was in Japanese. Not many other people were there when I visited. I wasn’t sure if it was because it was getting dark or if this place was just less frequented, but I enjoyed the tranquil, solitary walk through the park.",
  "shrine_1": "Near the north entrance of the park resides a beautiful Shinto shrine called Ozan Shrine (櫻山神社). The Shinto religion is very widespread in Japan, so I spotted many Shinto shrines in my travels. You’ll quickly be able to spot a shrine by seeing a sizable entrance gate called Torii that greets the approach of visitors. The Torii look like wooden arches, usually gray or orange and black in colour. The most famous of Shinto shrines is the Fushimi Inari Shrine in Kyoto where you can see thousands of orange Torii lined up all the way up the mountain.",
  "shrine_2": "Being locations of worship, these shrines often have offering halls where one can make prayers and provide donations to the upkeep of the shrine. They also often have purification troughs where visitors can purify their hands and mouth before entering the halls. There’s a whole process for purifying properly when entering, which I would recommend you learn before visiting a shrine and trying it yourself. I reached Ozan Shrine (also known as Sakurayama Shrine) when it was dark, after walking through most of Morioka Castle Ruins Park. It was closing up, and I saw some people leaving the shrine and others inside, cleaning up. I stayed briefly and observed them close the offering hall. Something interesting that I witnessed was a lady who looked like she just got off of work, walking to the entrance of the shrine, and without entering the shrine, quickly bowing and doing a quick prayer before setting off on her path again. People often visit Shinto shrines to pray for good fortune - in marriage, with school or work, with children, etc. They pay respect to the various kami (gods) that inhabit the shrines. I enjoyed visiting various Shinto shrines across Japan because they were very welcoming of foreigners, they did not seem to pressure anyone to donate or to join their religion, and the shrines themselves were very grand and beautiful.",
  "museum_1": "After momentarily looking at the Ozan Shrine, I walked to the Morioka History and Culture Museum which was also nearby. It’s a small museum describing some of the cultural aspects of Morioka. The first floor was free but you could pay a bit of money to visit the second floor which has some more exhibits, showcasing Morioka’s detailed history. The free showcase displayed the customs of the Morioka Sansa Odori Festival, held annually in early August. This festival, similar to others across Japan, incorporates a parade with dancing, music, and cultural attire. Groups of Taiko, a Japanese drum instrument, liven the parade and inform the whole city of the event. Unique food stalls are also assembled along the streets, selling yummy food for the thousands of people that attend. To try to attend this festival and other similar ones across Japan, it seems that visiting around July or August would be optimal.",
  "museum_2": "Another famous festival held in Iwate Prefecture where Morioka is the capital city, is the Chagu Chagu Umakko. The festival is a horse festival, where the people of Iwate celebrate the horses that work diligently on their farms. “Chagu Chagu” refers to the sound of the bells that are adorned on the horses. Along with the bells, the horses are dressed up fashionably, with lots of bright colours and fabrics often matching that of the owner’s festival costume. This festival occurs usually in June, and was selected as one of the 100 Soundscapes of Japan by the Ministry of the Environment.",
  "arcade_1": "In the 21st century, I don’t believe you’ll find as many arcades and arcade goers in any other country other than Japan. The arcade and video game culture is very relevant for not only a lot of young Japanese people, but also the older generation as well. This along with the continuous addition of new games and innovation in the industry allow it to thrive. As an accessible and very inexpensive way to pass time, I frequented many arcades during my travels in Japan. Larger Japanese arcades generally have many floors, separating the various categories of arcade games. The first floor usually contains games that allow players to win things like plushies or snacks. Upper floors are divided amongst fighting games, music and rhythm games, casino gambling games, and photo booths. I personally enjoyed the skill and challenge of rhythm games so spent most of my trip’s arcade budget there. On the other hand, I didn’t play claw games too often knowing that with my skills, I would have to dedicate a good amount of money to win something. I also didn’t want to carry around a large plush Winnie the Pooh with me for months (however later on in the trip I actually won something from a claw machine with pure skill and determination, not because I asked the arcade employee to help move the item).",
  "arcade_2": "My favourite rhythm game from my previous trip to Japan was Nostalgia Op 2. Nostalgia Op 2 is a music game where you have to time your key presses on the piano with the onscreen notes. Key presses can be done with two hands and consist of single presses, holds, and slides. The notes were spaced out to the actual song so it actually felt like you were playing the song. I never got to the level of those people you see on YouTube jamming out with their eyes closed and never missing a beat, but I did manage to get good at a couple of songs at the highest difficulty. While I left Japan this time having a different favourite rhythm game, Nostalgia Op 2 will always be up there in my top Japanese arcade games.",
  "headers": {
    "castle": "Morioka Castle - Iwate Park",
    "shrine": "Shinto Shrines",
    "museum": "Morioka History and Culture Museum",
    "arcade": "Arcades"
  }
}