{
  "intro": "After spending two days in Aomori, I left early in the morning on October 24th to head further south in Japan. My next stop was Morioka, another small and peaceful city with a similar population as Aomori. Morioka is generally more rural but I stayed mostly near Morioka station, the more urban area of Morioka. Like usual, I left Aomori early and got to Morioka early, ending up working in a coffee shop with my belongings because check in for hotels and hostels were usually past 3pm. I remember Morioka station being decently large, with quite a few restaurants in an underground section, and some buildings and coffee shops right outside. To preface this, I want to point out that I went out to the main outdoor destinations at night so I was not able to take that many photos with my camera. I also only spent two in Morioka, and visited most of the attractions on the main full day I had.",
  "park_1": "Half an hour walk away from my hotel was Morioka Castle and its surrounding park, known as Iwate Park or Morioka Castle Ruins Park. The castle was developed in the early 1600’s for the Nanbu samurai clan, the rulers of most of the northeast area of Honshū at the time. The castle itself was torn down later as part of the Meiji Restoration, but then later refurbished into the park that lives there today. Statues and other plaques litter the park grounds, providing more information about the castle that once stood there.",
  "park_2": "The rare Edo period castle was nice to visit during the fall season. Walking from the hotel to the park, I recall the blue sky getting darker, slowly being consumed by the glow of the setting sun. I walked by a Japanese daycare (as opposed to an American one I guess), and kids were laughing and running outside in a fenced yard behind the school. The daycare neighboured the Nakatsu River, in which the castle was also built next to. The park was densely filled with colourful trees and the ground was scattered with fallen leaves. Within the castle walls, a small bridge with red handrails connected two upper castle grounds. What seemed to be a giant tomb stood tall in one area of the park, with an informational card that was in Japanese. Not many other people were there when I visited. I wasn’t sure if it was because it was getting dark or if this place was just less frequented, but I enjoyed the tranquil, solitary walk through the park.",
  "headers": {
    "castle": "Morioka Castle - Iwate Park"
  }
}