{
  "para_1": "I brought with me a new 40L backpack that I purchased for the trip and a small cylinder duffel my dad got me when I visited Canada last. I packed a couple of days ahead, with the goal of travelling light. I had all my work things: laptop, charger, work phone (which came in handy many times), work phone charger. Toiletries were bare, packing: toothbrush, toothpaste, nail cutter, face wash, hairbands, and a small and large towel. In terms of clothes, I brought enough clothes to last myself a week, with the intention of buying clothes in Japan if needed. I packed 5 shirts, one long pair of pants, some shorts, a hat, and my backup glasses. In terms of miscellaneous items, I also brought a coin purse (because I was going to use a lot of cash), a notebook and pen (for journaling), an umbrella, my camera to take pictures, some elastic bands, plastic bags, the pocket Wi-Fi receipt, and my JR exchange passes that I preordered as well.",
  "para_2": "A note about the JR pass: the maximum length JR pass is only 30 days and I was going to be travelling for around double that period, so I preordered two passes with specified dates. I thought I would have to go to a station and exchange the receipt for the pass on the exact day, but it seems that they are lenient about what actual day you exchange it.",
  "para_3": "In terms of planning housing, I booked hostels for the first four or five locations and was planning to book as I go in case circumstances changed. HostelWorld is a great website for looking at hostels and they have availabilities in most cities I travelled to. They also have a pretty good cancellation policy in which I was able to cancel one a couple days in advance.",
  "para_4": "I went to work as usual on the day of my flight, bringing everything with me. I was planning on taking Bart to get to the airport early so I could get a free meal. I recall staying at the Cathay Pacific Airways First and Business Class Lounge at SFO, taking a late team meeting while drinking some beer and eating a bag of Cheetos (btw the Wi-Fi password, if you’re near the lounge, is \"cathay1234\"). Here is how I looked on that day, alluring as usual with my disheveled hair and tiny lifeless eyes, ready for my 15-hour flight from San Francisco to Hong Kong, and then finally Japan."
}
